# Antwoorden

Dit notebook bevat de uitwerking van de opdrachten uit het notebook [opdrachten](https://nbviewer.jupyter.org/github/Brinkhuis/Cursus/blob/master/notebooks/opdrachten.ipynb).

### Opdracht 1: string

In [1]:
opdracht = '<<< n-o-h-t-y-p >>>'

***

In [2]:
# uitwerking 1
opdracht[-5:3:-2].capitalize()

'Python'

In [3]:
# uitwerking 2
opdracht[4:-4][::-2].capitalize()

'Python'

In [4]:
# uitwerking 3
opdracht[4:-4].replace('-', '')[::-1].capitalize()

'Python'

In [5]:
# uitwerking 4
opdracht.split()[1].replace('-', '')[::-1].capitalize()

'Python'

In [6]:
# uitwerking 5
opdracht.strip('< >').replace('-', '')[::-1].capitalize()

'Python'

### Opdracht 2: list

In [7]:
opdracht = 'Without requirements or design, programming is the art of adding bugs to an empty text file.'.split()

In [8]:
uitkomst = 'Without requirements or design, coding Python is the art of adding bugs to an empty Jupyter Notebook.'.split()

***

In [9]:
# uitwerking 1
opdracht = 'Without requirements or design, programming is the art of adding bugs to an empty text file.'.split()

opdracht[opdracht.index('programming')] = 'coding'
opdracht.insert(opdracht.index('coding') + 1, 'Python')
opdracht.pop()
opdracht.pop()
opdracht.extend(['Jupyter', 'Notebook.'])

opdracht == uitkomst

True

In [10]:
# uitwerking 2
opdracht = 'Without requirements or design, programming is the art of adding bugs to an empty text file.'.split()

opdracht[opdracht.index('programming')] = 'coding'
opdracht.insert(opdracht.index('coding') + 1, 'Python')
opdracht.remove('text')
opdracht.remove('file.')
opdracht.append('Jupyter')
opdracht.append('Notebook.')

opdracht == uitkomst

True

### Opdracht 3: list comprehension

In [11]:
# uitwerking 1
%timeit [(c * 9/5 + 32) for c in range(100) if (c * 9/5 + 32) > 150 and int(str(c * 9/5 + 32).split('.')[-1]) == 0]

106 µs ± 6.62 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

Korte performance analyse:  
* 100 loops
* conversie van float naar string
* split string
* subsetting
* conversie van string naar int

In [12]:
# uitwerking 2
%timeit [(c * 9/5 + 32) for c in range(100) if (c * 9/5 + 32) > 150 and str(c * 9/5 + 32).split('.')[-1] == '0']

88 µs ± 2.17 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

Korte performance analyse:
* 100 loops
* conversie van float naar string
* split string
* subsetting

In [13]:
# uitwerking 3
%timeit [(c * 9/5 + 32) for c in range(100) if (c * 9/5 + 32) > 150 and (c * 9/5 + 32) == int(c * 9/5 + 32)]

59.7 µs ± 4.48 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

Korte performance analyse:
* 100 loops
* conversie van float naar int

In [14]:
# uitwerking 4
%timeit [(c * 9/5 + 32) for c in range(100) if (c * 9/5 + 32) > 150 and c % 5 == 0]

33.3 µs ± 746 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

Korte performance analyse:
* 100 loops

In [15]:
# uitwerking 5
%timeit [(c * 9/5 + 32) for c in range(0, 100, 5) if (c * 9/5 + 32) > 150]

8.26 µs ± 109 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

Korte performance analyse:
* 20 loops !!

Toelichting:  
* In de conversieformule wordt er gedeeld door 5.
* Elk veelvoud van 5 (tussen de 0 en de 100) levert daarom een geheel getal (integer) op bij delen door 5.
* En dat blijft een geheel getal als je er 32 bij optelt.
* Met deze wetenschap kun je het aantal loops flink terug brengen!
* Hiermee heb je tevens het voordeel dat er één conditie minder achter het if-statement nodig is.
* Daarmee is deze oplossing ongeveer 4x sneller dan de '2nd best solution' en ongeveer 12x sneller dan uitwerking nr 1.

### Opdracht 4a: for

In [16]:
# uitwerking 1
aantal = 0
for num in range(1, 101):
    if num % 2 == 0 or num % 3 == 0 or num % 4 == 0 or num % 5 == 0:
        continue
    aantal += 1
    print(num)
print('\nEr zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(aantal))

1
7
11
13
17
19
23
29
31
37
41
43
47
49
53
59
61
67
71
73
77
79
83
89
91
97

Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

In [17]:
# uitwerking 2
resultaat = list()
for num in range(1, 101):
    if num % 2 == 0 or num % 3 == 0 or num % 4 == 0 or num % 5 == 0:
        continue
    resultaat.append(num)
print(resultaat)
print('Er zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(len(resultaat)))

[1, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 49, 53, 59, 61, 67, 71, 73, 77, 79, 83, 89, 91, 97]
Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

In [18]:
# uitwerking 3
resultaat = list()
for num in range(1, 101):
    test_resultaat = True
    for test in range(2, 6):
        if num % test == 0:
            test_resultaat = False
            break
    if test_resultaat:
        resultaat.append(num)
print(resultaat)
print('Er zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(len(resultaat)))

[1, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 49, 53, 59, 61, 67, 71, 73, 77, 79, 83, 89, 91, 97]
Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

### Opdracht 4b: while

In [19]:
# uitwerking 1
num = 0
aantal = 0
while True:
    num += 1
    if num % 2 == 0 or num % 3 == 0 or num % 4 == 0 or num % 5 == 0:
        continue
    if num > 100:
        break
    print(num)
    aantal += 1
print('\nEr zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(aantal))

1
7
11
13
17
19
23
29
31
37
41
43
47
49
53
59
61
67
71
73
77
79
83
89
91
97

Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

In [20]:
# uitwerking 2
num = 0
resultaat = list()
while True:
    num += 1
    if num % 2 == 0 or num % 3 == 0 or num % 4 == 0 or num % 5 == 0:
        continue
    if num > 100:
        break
    resultaat.append(num)
print(resultaat)
print('Er zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(len(resultaat)))

[1, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 49, 53, 59, 61, 67, 71, 73, 77, 79, 83, 89, 91, 97]
Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

In [21]:
# uitwerking 3
num = 0
resultaat = list()
while True:
    num += 1
    teller = 0 # teller om het aantal getallen uit range(2, 6) te tellen waardoor num deelbaar is.
    for test in range(2, 6):
        if num % test == 0:
            teller += 1
            break # break de for loop als num deelbaar is door een getal uit range(2, 6)
    if teller == 0:
        resultaat.append(num)
    if num >= 100:
        break
print(resultaat)
print('Er zijn {} getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.'.format(len(resultaat)))

[1, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 49, 53, 59, 61, 67, 71, 73, 77, 79, 83, 89, 91, 97]
Er zijn 26 getallen gevonden die niet deelbaar zijn door 2, 3, 4 of 5.

### Opdracht 5a: function

In [22]:
def deel(x, y):
    return x // y, x % y

deel(15, 7)

(2, 1)

### Opdracht 5b: error handling

In [23]:
# uitwerking
def deel(x = None, y = 1):
    try:
        if x == None:
            raise ValueError("Argument 'x' ontbreekt of heeft waarde 'None'")
        return x // y, x % y
    except ZeroDivisionError as E:
        print(E)
    except TypeError as E:
        print(E)
    except ValueError as E:
        print(E)

In [24]:
print(1, deel(15, 7), '\n') # (2, 1)
print(2, deel(7, 15), '\n') # (0, 7)
print(3, deel(15), '\n') # (15, 0)
print(4, deel(0, 15), '\n') # (0, 0)
print(5, deel(5.5, 2.5), '\n') # (2.0, 0.5)
print(6, deel(15, 0), '\n') # integer division or modulo by zero
print(7, deel('vijftien', 'zeven'), '\n') # unsupported operand type(s) for //: 'str' and 'str'
print(8, deel([15, 7]), '\n') # unsupported operand type(s) for //: 'list' and 'int'
print(9, deel(y = 7)) # Argument 'x' ontbreekt of heeft waarde 'None'

1 (2, 1)

2 (0, 7)

3 (15, 0)

4 (0, 0)

5 (2.0, 0.5)

integer division or modulo by zero
6 None

unsupported operand type(s) for //: 'str' and 'str'
7 None

unsupported operand type(s) for //: 'list' and 'int'
8 None

Argument 'x' ontbreekt of heeft waarde 'None'
9 None

In [25]:
# uitwerking, optioneel
def deel(x = None, y = 1):
    try:
        if x == None:
            raise ValueError("Argument 'x' ontbreekt of heeft waarde 'None'")
        if int(x % y) == x % y:
            return {'aantal': int(x // y), 'rest': int(x % y)}
        else:
            return {'aantal': int(x // y), 'rest': x % y}
    except ZeroDivisionError as E:
        print(E)
    except TypeError as E:
        print(E)
    except ValueError as E:
        print(E)

In [26]:
print(deel(8.5, 2.5), '\n')
print('aantal:', type(deel(8.5, 2.5)['aantal']))
print('rest  :', type(deel(8.5, 2.5)['rest']))

{'aantal': 3, 'rest': 1}

aantal: <class 'int'>
rest  : <class 'int'>

In [27]:
print(deel(8.5, 3.5), '\n')
print('aantal:', type(deel(8.5, 3.5)['aantal']))
print('rest  :', type(deel(8.5, 3.5)['rest']))

{'aantal': 2, 'rest': 1.5}

aantal: <class 'int'>
rest  : <class 'float'>

### Opdracht 6: lambda expression

In [28]:
celsius = range(100)

***

In [29]:
list(filter(lambda f: f > 200, map(lambda c: c * 9 / 5 + 32, celsius)))

[201.2, 203.0, 204.8, 206.6, 208.4, 210.2]

### Opdracht 7: inlezen csv

In [30]:
import pandas as pd

In [31]:
# uitwerking 1
file = '../data/leesmij.csv'
pd.read_csv(file, sep='/', skiprows=1, engine='python', skipfooter=2, na_values=['??', '-', ' ', '  ']).tail(7)

    id  leeftijd geslacht groep
43  44        96        V   NaN
44  45        46        V     C
45  46        38        M     A
46  47        41        V     A
47  48        28        V     C
48  49        92      NaN     C
49  50        22        M     C

In [32]:
# uitwerking 2
file = '../data/leesmij.csv'
pd.read_csv(file, sep='/', skiprows=1, na_values=['??', '-', ' ', '  '])[:-2].tail(7)

    id  leeftijd geslacht groep
43  44      96.0        V   NaN
44  45      46.0        V     C
45  46      38.0        M     A
46  47      41.0        V     A
47  48      28.0        V     C
48  49      92.0      NaN     C
49  50      22.0        M     C

In [33]:
# uitwerking 3
import sys
import os

f = open('../data/leesmij.csv', 'r')
lines = f.readlines()

f = open('../data/leesmij_geschoond.csv', 'w')

for line in lines[1:-2]:
    f.write(line)
f.close()

print(pd.read_csv('../data/leesmij_geschoond.csv', sep='/', na_values=['??', '-', ' ', '  ']).tail(7))

os.remove('../data/leesmij_geschoond.csv')

    id  leeftijd geslacht groep
43  44        96        V   NaN
44  45        46        V     C
45  46        38        M     A
46  47        41        V     A
47  48        28        V     C
48  49        92      NaN     C
49  50        22        M     C

### Opdracht 8: genereren data

In [34]:
import pandas as pd
import numpy as np

In [35]:
np.random.seed(42)
aantal_personen = 10000
df = pd.DataFrame({'id': np.random.choice(range(10000, 100000), aantal_personen),
                   'grp': np.random.choice(range(1, 41), aantal_personen, replace=True),
                   'fkg': np.random.choice(range(2), aantal_personen, replace=True),
                   'dkg': np.random.choice(range(2), aantal_personen, replace=True)})
df.sample(n=10)

         id  grp  fkg  dkg
2906  90685    1    0    1
781   16949   35    1    0
8934  86928   13    0    1
1030  14018   16    1    0
3768  37606    2    0    0
8610  31577   34    1    1
832   33061   36    0    1
7116  70101   30    0    0
811   27144    9    1    0
6708  79101   35    1    1

### Opdracht 9a: toevoegen kolom

In [36]:
df['geslacht'] = np.where(df.grp <= 20, 'man', 'vrouw')
df.head()

      id  grp  fkg  dkg geslacht
0  25795    6    1    1      man
1  10860   13    1    0      man
2  86820   22    0    0    vrouw
3  64886   31    1    1    vrouw
4  16265   22    1    0    vrouw

### Opdracht 9b: toevoegen kolom

In [37]:
# uitwerking 1
df['65'] = ['65+' if (g >= 14 and g <= 20) or g >= 34 else '65-' for g in df.grp]
df.head(10)

      id  grp  fkg  dkg geslacht   65
0  25795    6    1    1      man  65-
1  10860   13    1    0      man  65-
2  86820   22    0    0    vrouw  65-
3  64886   31    1    1    vrouw  65-
4  16265   22    1    0    vrouw  65-
5  92386   37    0    1    vrouw  65+
6  47194   27    1    0    vrouw  65-
7  97498   14    1    1      man  65+
8  54131    5    1    0      man  65-
9  70263   36    0    1    vrouw  65+

In [38]:
# uitwerking 2
df['65'] = ['65-' if g <= 13 or (g >= 21 and g <= 33) else '65+' for g in df.grp]
df.head(10)

      id  grp  fkg  dkg geslacht   65
0  25795    6    1    1      man  65-
1  10860   13    1    0      man  65-
2  86820   22    0    0    vrouw  65-
3  64886   31    1    1    vrouw  65-
4  16265   22    1    0    vrouw  65-
5  92386   37    0    1    vrouw  65+
6  47194   27    1    0    vrouw  65-
7  97498   14    1    1      man  65+
8  54131    5    1    0      man  65-
9  70263   36    0    1    vrouw  65+

### Opdracht 9c: toevoegen kolom

In [39]:
def leeftijd_categorie(grp):
    leeftijd_start = grp * 5 - 5
    leeftijd_eind = grp * 5 - 1
    return str(leeftijd_start) + '-' + str(leeftijd_eind)

***

In [40]:
# uitwerking 1
df['leeftijd_categorie'] = df['grp'].apply(lambda x: leeftijd_categorie(x) if (x <= 20) else leeftijd_categorie(x - 20))
df.head(3)

      id  grp  fkg  dkg geslacht   65 leeftijd_categorie
0  25795    6    1    1      man  65-              25-29
1  10860   13    1    0      man  65-              60-64
2  86820   22    0    0    vrouw  65-                5-9

In [41]:
# uitwerking 2
df['leeftijd_categorie'] = [leeftijd_categorie(x) if x <= 20 else leeftijd_categorie(x - 20) for x in df.grp]
df.head(3)

      id  grp  fkg  dkg geslacht   65 leeftijd_categorie
0  25795    6    1    1      man  65-              25-29
1  10860   13    1    0      man  65-              60-64
2  86820   22    0    0    vrouw  65-                5-9

In [42]:
# uitwerking 3
df['leeftijd_categorie'] = list(map(lambda g: leeftijd_categorie(g) if g <= 20 else leeftijd_categorie(g - 20), df.grp))
df.head(3)

      id  grp  fkg  dkg geslacht   65 leeftijd_categorie
0  25795    6    1    1      man  65-              25-29
1  10860   13    1    0      man  65-              60-64
2  86820   22    0    0    vrouw  65-                5-9

### Opdracht 9d: toevoegen kolom

In [43]:
# uitwerking 1
df['gezondheid_status'] = np.where((df.fkg == 0) & (df.dkg == 0), 'gezond','ongezond')
df.head(10)

      id  grp  fkg  dkg geslacht   65 leeftijd_categorie gezondheid_status
0  25795    6    1    1      man  65-              25-29          ongezond
1  10860   13    1    0      man  65-              60-64          ongezond
2  86820   22    0    0    vrouw  65-                5-9            gezond
3  64886   31    1    1    vrouw  65-              50-54          ongezond
4  16265   22    1    0    vrouw  65-                5-9          ongezond
5  92386   37    0    1    vrouw  65+              80-84          ongezond
6  47194   27    1    0    vrouw  65-              30-34          ongezond
7  97498   14    1    1      man  65+              65-69          ongezond
8  54131    5    1    0      man  65-              20-24          ongezond
9  70263   36    0    1    vrouw  65+              75-79          ongezond

In [44]:
# uitwerking 2
df['gezondheid_status'] = list(map(lambda fkg, dkg: 'gezond' if (fkg == 0 and dkg == 0) else 'ongezond', df.fkg, df.dkg))
df.head(10)

      id  grp  fkg  dkg geslacht   65 leeftijd_categorie gezondheid_status
0  25795    6    1    1      man  65-              25-29          ongezond
1  10860   13    1    0      man  65-              60-64          ongezond
2  86820   22    0    0    vrouw  65-                5-9            gezond
3  64886   31    1    1    vrouw  65-              50-54          ongezond
4  16265   22    1    0    vrouw  65-                5-9          ongezond
5  92386   37    0    1    vrouw  65+              80-84          ongezond
6  47194   27    1    0    vrouw  65-              30-34          ongezond
7  97498   14    1    1      man  65+              65-69          ongezond
8  54131    5    1    0      man  65-              20-24          ongezond
9  70263   36    0    1    vrouw  65+              75-79          ongezond

### Opdracht 10a: lees tabblad Excel

In [45]:
excel = pd.read_excel(io = '../data/leesmij.xlsx',
                      sheet_name = '2018',
                      skiprows = 2,
                      usecols = 'D:H',
                      skipfooter = 1,
                      na_values = '???'
                     )
excel

    Regio    Q1    Q2      Q3    Q4
0   Noord  1210  1225  1230.0  1205
1    Oost  1295  1310  1315.0  1290
2  Midden  1111  1208  1298.0  1138
3    Zuid  1330  1345     NaN  1325
4    West  1135  1150  1155.0  1130

### Opdracht 10b: lees alle tabbladden Excel

In [46]:
excel = pd.read_excel(io = '../data/leesmij.xlsx',
                      sheet_name = None,
                      skiprows = 2,
                      usecols = 'D:H',
                      skipfooter = 1,
                      na_values = '???'
                     )

In [47]:
# type
type(excel)

collections.OrderedDict

In [48]:
# toon data uit tabblad 2018
excel['2017']

   Regio    Q1    Q2      Q3    Q4
0  Noord  1210  1250  1231.0  1160
1   Oost  1265  1290  1342.0  1270
2   Zuid  1222  1259     NaN  1238
3   West  1160  1145  1140.0  1190

In [49]:
# type
type(excel['2017'])

pandas.core.frame.DataFrame

### Opdracht 10c: lees alle tabbladen in één DataFrame

In [50]:
df = pd.DataFrame() # creëer een leeg DataFrame
for key in excel.keys():
    sheet = excel[key].fillna(0) # fill na-values with zero
    sheet[['Q1', 'Q2', 'Q3', 'Q4']] = sheet[['Q1', 'Q2', 'Q3', 'Q4']].astype(int) # convert float to int
    sheet['Jaar'] = int(key)
    df = pd.concat([df, sheet], ignore_index = True) # alternatief: df = df.append(sheet, ignore_index = True)
df.tail(9) # toon laatste 2 jaar

     Regio    Q1    Q2    Q3    Q4  Jaar
12   Noord  1210  1250  1231  1160  2017
13    Oost  1265  1290  1342  1270  2017
14    Zuid  1222  1259     0  1238  2017
15    West  1160  1145  1140  1190  2017
16   Noord  1210  1225  1230  1205  2018
17    Oost  1295  1310  1315  1290  2018
18  Midden  1111  1208  1298  1138  2018
19    Zuid  1330  1345     0  1325  2018
20    West  1135  1150  1155  1130  2018

### Opdracht 10d: Wide to Long

In [51]:
# wide to long
df_long = pd.melt(df, id_vars = ['Regio', 'Jaar'], var_name = 'Kwartaal', value_name = 'Aantal')
df_long[df_long.Jaar == 2017] # toon jaar 2017

    Regio  Jaar Kwartaal  Aantal
12  Noord  2017       Q1    1210
13   Oost  2017       Q1    1265
14   Zuid  2017       Q1    1222
15   West  2017       Q1    1160
33  Noord  2017       Q2    1250
34   Oost  2017       Q2    1290
35   Zuid  2017       Q2    1259
36   West  2017       Q2    1145
54  Noord  2017       Q3    1231
55   Oost  2017       Q3    1342
56   Zuid  2017       Q3       0
57   West  2017       Q3    1140
75  Noord  2017       Q4    1160
76   Oost  2017       Q4    1270
77   Zuid  2017       Q4    1238
78   West  2017       Q4    1190

### Opdracht 11: Interactive Visualization

In [52]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from ipywidgets import *

In [53]:
sns.set(style="white")
iris = sns.load_dataset("iris")

def iris_pairgrid(species):
    g = sns.PairGrid(iris[iris.species.isin(species)], diag_sharey=False)
    g.map_lower(sns.kdeplot)
    g.map_upper(sns.scatterplot)
    g.map_diag(sns.kdeplot, lw = 3)
    return plt.show()

interact(iris_pairgrid,
         species = widgets.SelectMultiple(options = iris.species.unique(),
                                          value = ('versicolor', 'virginica'),
                                          rows = len(iris.species.unique()),
                                          description = 'species',
                                          disabled = False))

interactive(children=(SelectMultiple(description='species', index=(1, 2), options=('setosa', 'versicolor', 'vi…